In [1]:
import numpy as np

Задание 1

In [2]:
a = np.array([[1,6],[2,8],[3,11],[3,10],[1,7]])
mean_a = a.mean(axis =0)
mean_a

array([2. , 8.4])

Задание 2

In [4]:
a_centered = a - mean_a
a_centered

array([[-1. , -2.4],
       [ 0. , -0.4],
       [ 1. ,  2.6],
       [ 1. ,  1.6],
       [-1. , -1.4]])

Задание 3

In [11]:
a_centered_sp = np.dot(a_centered[:,0],a_centered[:,1])
a_centered_sp/(len(a_centered)-1)

2.0

Задание 1

In [13]:
import pandas as pd

In [17]:
authors = pd.DataFrame({'author_id':[1,2,3], 'author_name':['Тургенев', 'Чехов', 'Островский']})
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [21]:
book = pd.DataFrame({'author_id':[1, 1, 1, 2, 2, 3, 3], 
                     'book_title':['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 
                                   'Дама с собачкой', 'Гроза', 'Таланты и поклонники'], 
                     'price':[450, 300, 350, 500, 450, 370, 290]})
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

Задание 2

In [22]:
authors_price = pd.merge(authors, book, how='inner', on = 'author_id')
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

Задание 3

In [29]:
top_5 = authors_price.sort_values(by='price', ascending= False, ignore_index=True).head(5)
top_5

   author_id author_name         book_title  price
0          2       Чехов   Толстый и тонкий    500
1          1    Тургенев        Отцы и дети    450
2          2       Чехов    Дама с собачкой    450
3          3  Островский              Гроза    370
4          1    Тургенев  Дворянское гнездо    350

In [30]:
top5= authors_price.nlargest(5, 'price')
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

Задание 4

In [51]:
authors_mean = authors_price.groupby('author_name').price.mean()
authors_min = authors_price.groupby('author_name').price.min()
authors_max = authors_price.groupby('author_name').price.max()
authors_stat_1= pd.merge(authors,authors_mean, on = 'author_name').rename(columns = {'price':'mean_price'})
authors_stat_2 = pd.merge(authors_stat_1,authors_min, on = 'author_name').rename(columns = {'price':'min_price'})
authors_stat = pd.merge(authors_stat_2,authors_max, on = 'author_name').rename(columns = {'price':'max_price'})
authors_stat

   author_id author_name  mean_price  min_price  max_price
0          1    Тургенев  366.666667        300        450
1          2       Чехов  475.000000        450        500
2          3  Островский  330.000000        290        370

In [82]:
authors_stat_new =authors_price.groupby('author_name').agg({'price_mean':'mean','price_min':'min','price_max':'max'}).reset_index()

SpecificationError: nested renamer is not supported